      01  SOURCE-MASTER-RECORD.
           05  SR-NAME             PIC X(18).
           05  SR-L-DEG            PIC S9(3)V9(9)  COMP-3.
           05  SR-B-DEG            PIC S9(3)V9(9)  COMP-3.
           05  SR-RADIUS           PIC S9(1)V9(1)  COMP-3.
           05  SR-LAST-UPDATE      PIC 9(08).
           05  SR-SOURCE-TYPE      PIC X(05).